function F = ci_chang_fan_wei(P)
%判断点的位置是否在磁场影响范围内的函数，返回逻辑1或者0
[Q,~,~,R,~]=settings(1);
if length(P) ~= 3
    disp('磁场范围错误：输入的不是坐标');
    F = 0;
    return

else

 Pp = abs(P);
 %******************首先圈定高度*******************
    F1 =  0<=P(3) & P(3)<=Q(3);%高度

 %******************然后圈定X位置*******************

    F2 = Pp(1) <= abs((Q(1) - R(1))*Pp(3)/Q(3) + R(1));

 %******************然后圈定X位置*******************

    F3 = Pp(2) <= abs((Q(2) - R(2))*Pp(3)/Q(3) + R(2));
    

    F = F1&F2&F3;
    
end
end
