function F = ci_chang_fan_wei(P)
%判断点的位置是否在磁场影响范围内的函数，返回逻辑1或者0
[Q,~,~,~,~]=settings(1);%Q = [0.120 0.120 0.015]
if length(P) ~= 3
    disp('磁场范围错误：输入的不是坐标');
    F = 0;
    return
    
else
    %******************首先是垂直范围*******************
    F0 = abs(P(3))<=Q(3);
    
    %******************外圆之内*******************
    F1 = sqrt(P(1)^2 + P(2)^2) <= Q(1); %151mm
    
    %******************内圆之外*******************
    F2 = sqrt(P(1)^2 + P(2)^2) >= 25e-3;%25mm
    
    %******************然后去除辐条*******************
    %辐条厚度 abs(P(3)) <= 2.5e-3 宽度4mm
    %点和直线之间的距离 D = abs(a*P(1) + b*P(2) + c)/sqrt(a^2 + b^2)
    G1 = abs(P(3)) <= 2.5e-3 & abs(P(2)) <= 2e-3;       %直线 y = 0;
    G2 = abs(P(3)) <= 2.5e-3 & abs(tan(pi/8)*P(1) - P(2))/sqrt(tan(pi/8)^2 + 1) <= 2e-3;       %直线 y = tan(pi/8)*x;
    G3 = abs(P(3)) <= 2.5e-3 & abs(tan(2*pi/8)*P(1) - P(2))/sqrt(tan(2*pi/8)^2 + 1) <= 2e-3;         %直线 y = tan(2*pi/8)*x;
    G4 = abs(P(3)) <= 2.5e-3 & abs(tan(3*pi/8)*P(1) - P(2))/sqrt(tan(3*pi/8)^2 + 1) <= 2e-3;         %直线 y = tan(3*pi/8)*x;
    G5 = abs(P(3)) <= 2.5e-3 & abs(P(1)) <= 2e-3;         %直线 x = 0;
    G6 = abs(P(3)) <= 2.5e-3 & abs(tan(5*pi/8)*P(1) - P(2))/sqrt(tan(5*pi/8)^2 + 1) <= 2e-3;         %直线 y = tan(5*pi/8)*x;
    G7 = abs(P(3)) <= 2.5e-3 & abs(tan(6*pi/8)*P(1) - P(2))/sqrt(tan(6*pi/8)^2 + 1) <= 2e-3;         %直线 y = tan(6*pi/8)*x;
    G8 = abs(P(3)) <= 2.5e-3 & abs(tan(7*pi/8)*P(1) - P(2))/sqrt(tan(7*pi/8)^2 + 1) <= 2e-3;         %直线 y = tan(7*pi/8)*x;
    %综合
    F3 = ~(G1|G2|G3|G3|G4|G5|G6|G7|G8);
    
    
    %输出结果
    F = F0&F1&F2&F3;
    
end
end
