function F = ci_chang_fan_wei(P)
%判断点的位置是否在磁场影响范围内的函数，返回逻辑1或者0
[Q,~,~,~,~]=settings(1);
if length(P) ~= 3
    disp('磁场范围错误：输入的不是坐标');
    F = 0;
    return

else
    Pp = abs(P);
 %*******************分成两个步骤***********************
 %******************首先圈定大范围*******************
    F1 = Pp(1)<=Q(1) & Pp(2)<=Q(2) & Pp(3)<=Q(3);%大范围

 %******************然后去除中间十字范围*******************
%     G1 = Pp(1)<=0.0075|Pp(2)<=0.0075;
    G0 = Pp(3)<=0.005;%z轴方向，磁体厚度0.01米,这个范围才有可能被工装挡住
    
    G1 = Pp(1) <= 0.0075 & Pp(2) <= 0.0075;%中心15*15的区域过不去
    G2 = Pp(1) <= 0.0055;%y方向长条状磁体挡住了
    G3 = Pp(2) <= 0.0055;%x方向长条状磁体挡住了
    G = G0 & (G1|G2|G3);
    
    F2 = ~G;
    %F = F1&F2;
    F = F1;
    
end
end
